CSI API ETABS v1

# cCaseResponseSpectrumGetModalCase Method

---

**Namespace:** ETABSv1
**Assembly:** ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (1.27.0.0)

Syntax

C#

VB

C++

F#

Copy

    int GetModalCase(
    	string Name,
    	ref string ModalCase
    )

    Function GetModalCase (
    	Name As String,
    	ByRef ModalCase As String
    ) As Integer

    Dim instance As cCaseResponseSpectrum
    Dim Name As String
    Dim ModalCase As String
    Dim returnValue As Integer

    returnValue = instance.GetModalCase(Name,
    	ModalCase)

    int GetModalCase(
    	String^ Name,
    	String^% ModalCase
    )

    abstract GetModalCase :
            Name : string *
            ModalCase : string byref -> int

#### Parameters

Name

    Type: SystemString

ModalCase

    Type: SystemString

#### Return Value

Type: Int32

See Also

#### Reference

cCaseResponseSpectrum Interface

ETABSv1 Namespace

ETABS®, SAFE®, SAP2000® and CSiBridge® are registered trademarks of Computers
and Structures, Inc.

Copyright © Computers and Structures, Inc. 2023. All rights
reserved.

support@csiamerica.com